---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingLayout
source: html/34b0f335-5e09-1a59-3a9b-82e352ebbb00.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingLayout Property

"Layout"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingLayout { get; }
```